test/zimg_2.0.0_ab-test.txt
zimg 2.0.0 ab-test


ab -c 300 -n 20000 "http://10.77.121.138:4869/5f189d8ec57f5a5a0d3dcba47fa797e2"

mode 1:

test 1:
Concurrency Level:      300
Time taken for tests:   5.781 seconds
Complete requests:      20000
Failed requests:        0
Write errors:           0
Total transferred:      594209709 bytes
HTML transferred:       592329615 bytes
Requests per second:    3459.66 [#/sec] (mean)
Time per request:       86.714 [ms] (mean)
Time per request:       0.289 [ms] (mean, across all concurrent requests)
Transfer rate:          100379.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   14 199.7      0    3002
Processing:    27   72  13.8     66     102
Waiting:        8   69  14.4     63      99
Total:         35   86 200.4     66    3094

test 2:
Concurrency Level:      300
Time taken for tests:   5.663 seconds
Complete requests:      20000
Failed requests:        0
Write errors:           0
Total transferred:      594204820 bytes
HTML transferred:       592324726 bytes
Requests per second:    3531.39 [#/sec] (mean)
Time per request:       84.952 [ms] (mean)
Time per request:       0.283 [ms] (mean, across all concurrent requests)
Transfer rate:          102459.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9 154.2      1    3002
Processing:    29   76  56.6     74    3015
Waiting:        9   72  56.2     71    3007
Total:         46   84 164.3     74    3094


test 3:
Concurrency Level:      300
Time taken for tests:   5.766 seconds
Complete requests:      20000
Failed requests:        0
Write errors:           0
Total transferred:      594188760 bytes
HTML transferred:       592308666 bytes
Requests per second:    3468.79 [#/sec] (mean)
Time per request:       86.486 [ms] (mean)
Time per request:       0.288 [ms] (mean, across all concurrent requests)
Transfer rate:          100640.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  30.0      0    3001
Processing:    24   85 102.4     80    3091
Waiting:       13   81 101.7     77    3079
Total:         42   86 106.9     81    3099


mode 2:

test 1:


test 2:

test 3:


mode 3:

test 1:

test 2:

test 3: